In [14]:
# %% [markdown]
# # Titanic Dataset Veracity Analysis
#
# This notebook compares the Kaggle Titanic dataset with external sources (Wikipedia and TitanicFacts.net) to assess data completeness and accuracy, focusing on passenger age information.

# %% [markdown]
# ## 1. Imports and Setup

# %%
import re
from difflib import get_close_matches

import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import requests
import seaborn as sns

sns.set_theme(style="whitegrid")
plt.rcParams["figure.figsize"] = (12, 6)

# %% [markdown]
# ## 2. Data Loading


# %%
def load_kaggle_data(train_path="../data/train.csv", test_path="../data/test.csv"):
    """Load and concatenate Kaggle Titanic train and test datasets."""
    train = pd.read_csv(train_path)
    test = pd.read_csv(test_path)
    return pd.concat([train, test], ignore_index=True)


def load_wikipedia_data():
    """Load Titanic passenger tables from Wikipedia, fixing smart quotes."""
    url = "https://en.wikipedia.org/wiki/Passengers_of_the_Titanic"
    resp = requests.get(url)
    html = resp.text
    # Replace smart quotes with normal quotes
    html = html.replace('“', '"').replace('”', '"').replace("‘", "'").replace("’", "'")
    tables = pd.read_html(html, header=0)
    # Filter for tables with Name and Age columns
    passenger_tables = [t for t in tables if 'Name' in t.columns and 'Age' in t.columns]
    return passenger_tables



def load_titanicfacts_data():
    """Load Titanic passenger tables from TitanicFacts.net."""
    url = "http://www.titanicfacts.net/titanic-passenger-list.html"
    return pd.read_html(url, header=0)


# %%
titanic_kaggle = load_kaggle_data()
wiki_tables = load_wikipedia_data()
facts_tables = load_titanicfacts_data()

/var/folders/pf/662q3gzd6413np78gpd4p9hr0000gn/T/ipykernel_62363/3775852612.py:41: FutureWarning: Passing literal html to 'read_html' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  tables = pd.read_html(html, header=0)

In [15]:
titanic_kaggle

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1305,NaN,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1305,1306,NaN,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1306,1307,NaN,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1307,1308,NaN,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1308,1309,NaN,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [16]:
type(facts_tables)

list

In [17]:
wiki_tables

[                                                  Name Age  \
 0                                  Abelson, Mr. Samuel  30
 1                    Abelson, Mrs. Anna (née Wizosky?)  28
 2                             Andrew, Mr. Edgar Samuel  17
 3                             Andrew, Mr. Frank Thomas  30
 4                                Angle, Mr. William A.  32
 ..                                                 ...  ..
 273  Wilkinson, Miss Elizabeth Anne (alias Mrs. Eli...  29
 274                       Williams, Mr. Charles Eugene  23
 275                      Woodward, Mr. John Wesley[79]  32
 276                                Wright, Miss Marion  26
 277                              Yvois, Miss Henriette  24

                              Hometown      Boarded  \
 0                              Russia    Cherbourg
 1                              Russia    Cherbourg
 2    San Ambrosio, Córdoba, Argentina  Southampton
 3          Redruth, Cornwall, England  Southampton
 4      Warwick, Warwickshire, England  Southampton
 ..                                ...          ...
 273               Manchester, England  Southampton
 274           Harrow, London, England  Southampton
 275      Oxford, Oxfordshire, England  Southampton
 276         Yeovil, Somerset, England  Southampton
 277                     Paris, France  Southampton

                         Destination Lifeboat Body
 0            New York, New York, US      NaN  NaN
 1            New York, New York, US       10  NaN
 2           Trenton, New Jersey, US      NaN  NaN
 3            Houghton, Michigan, US      NaN  NaN
 4                     New York City      NaN  NaN
 ..                              ...      ...  ...
 273  Philadelphia, Pennsylvania, US       16  NaN
 274           Chicago, Illinois, US       14  NaN
 275                   New York City      NaN  NaN
 276       Cottage Grove, Oregon, US        9  NaN
 277        Montreal, Quebec, Canada      NaN  NaN

 [278 rows x 7 columns],
                                                  Name Age   Class  \
 0                              Brand, Mr. Karl Birger  29   First
 1                 Browne, Father Francis Patrick Mary  31   First
 2                                         Collis, Mr.   –   First
 3                                   Davies, Mr. H. V.   –  Second
 4                                     Davies, Miss K.   –  Second
 5                                   De Grasse, Mr. J.   –   First
 6                           Dyer-Edwardes, Mr. Thomas  65   First
 7        Dyer-Edwardes, Mrs. Clementina Georgina Lucy  53   First
 8                                         Evans, Miss   –  Second
 9                                   Fletcher, Miss N.   –   First
 10                                     Forman, Mr. J.   –   First
 11                                       Forman, Mrs.   –   First
 12      Lenox-Conyngham, Miss Alice Katherine Harriet  39   First
 13  Lenox-Conyngham, Mrs. Barbara Josephine (née T...  48   First
 14                  Lenox-Conyngham, Miss Eileen Mary  11   First
 15                 Lenox-Conyngham, Master Denis Hugh  10   First
 16                                May, Mr. Richard W.  54   First
 17                                   May, Mr. Stanley  45   First
 18                                        Mullen, Mr.   -  Second
 19                                    Nichols, Mr. E.  48   First
 20                          Noel, Major Gerard Thomas  56   First
 21               Noel, Master William Henry Middleton  13   First
 22                                   Odell, Miss Kate  42   First
 23                               Odell, Mrs. Lily May  40   First
 24                          Odell, Master Jack Dudley  11   First
 25                                   Osborne, Miss D.   –  Second
 26                                      Remesch, Miss   –  Second
 27                                    Stevens, Mr. G.   –   First
 28                                        Tovey, Miss   –  Second
 29                          Wotton, Mr. Henry Swaffin  54   First

                             Hometown      Boarded     Disembarked
 0   Falköping, Västergötland, Sweden  Southampton       Cherbourg
 1                    Dublin, Ireland  Southampton      Queenstown
 2                                  –  Southampton       Cherbourg
 3                                  –  Southampton       Cherbourg
 4                                  –  Southampton       Cherbourg
 5                                  –  Southampton       Cherbourg
 6                Kensington, England  Southampton  Cherbourg[111]
 7                Kensington, England  Southampton       Cherbourg
 8                                  –  Southampton       Cherbourg
 9                                  –  Southampton       Cherbourg
 10                                 –  Southampton       Cherbourg
 11                                 –  Southampton       Cherbourg
 12                                 –  Southampton       Cherbourg
 13                                 –  Southampton       Cherbourg
 14                                 –  Southampton       Cherbourg
 15                                 –  Southampton       Cherbourg
 16                                 –  Southampton      Queenstown
 17                                 –  Southampton      Queenstown
 18                                 –  Southampton       Cherbourg
 19                                 –  Southampton      Queenstown
 20                                 –  Southampton       Cherbourg
 21                                 –  Southampton       Cherbourg
 22                                 –  Southampton      Queenstown
 23                                 –  Southampton      Queenstown
 24                                 –  Southampton      Queenstown
 25                                 –  Southampton       Cherbourg
 26                                 –  Southampton       Cherbourg
 27                                 –  Southampton       Cherbourg
 28                                 –  Southampton       Cherbourg
 29                                 –  Southampton       Cherbourg  ]